src/test/resources/soap.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <ns1:RequestHeader
                soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
                soapenv:mustUnderstand="0"
                xmlns:ns1="https://www.google.com/apis/ads/publisher/v202305">
            <ns1:networkCode>888888</ns1:networkCode>
            <ns1:applicationName>DfpApi-Java-2.1.0-dfp_test</ns1:applicationName>
        </ns1:RequestHeader>
    </soapenv:Header>
    <soapenv:Body>
        <getAdUnitsByStatement xmlns="https://www.google.com/apis/ads/publisher/v202305">
            <filterStatement>
                <query>WHERE</query>
            </filterStatement>
        </getAdUnitsByStatement>
    </soapenv:Body>
</soapenv:Envelope>